src/toir_cfe/src/Documents/торо_ЗаказПоставщику/торо_ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ea0c46c6-a489-4fec-a5ec-2e91bebe1e24">
  <name>торо_ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3b47a138-9f41-4b4c-adf0-4fb984da5d29">
    <name>ДатаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="915d4a24-202f-4778-b76b-2ef211f1ebb6">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a9b760-8a14-498c-bf16-ca4746b443c4">
    <name>проф_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c11b0572-c98c-4def-93b1-efe6330bd461">
    <name>проф_СостоянияЗаказовПоставщикам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/проф_ЗаказыПоставщику/проф_ЗаказыПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="13b3dbe6-068e-4230-9851-c9b16955da47">
  <name>проф_ЗаказыПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="e948a823-3feb-4e2d-a6c4-c3534bea1ef0">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="61aa1b48-840d-41e9-8da7-96d94fcae806">
    <name>ДатаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="6c906e57-098b-4b4c-9470-49e9ae5b2947">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1fa0deb6-40e2-4ca6-8cd5-d100464cd979">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="2295257b-d9db-4394-91c2-e6a46dcd82d7">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a3408ac2-5051-43da-aa84-1d6b40936797">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="202c1c8c-4f45-46da-9e57-827f13e99ce4">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/торо_ЗаказПоставщику/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

&После("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ Проф-ИТ, #82, Иванова Е.С., 18.09.2023
	Движения.проф_ЗаказыПоставщику.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
				   |	торо_ЗаказПоставщикуТовары.проф_Назначение КАК Назначение,
	               |	торо_ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	               |	СУММА(торо_ЗаказПоставщикуТовары.Количество) КАК Количество,
	               |	торо_ЗаказПоставщикуТовары.Склад КАК Склад
	               |ИЗ
	               |	Документ.торо_ЗаказПоставщику.Товары КАК торо_ЗаказПоставщикуТовары
	               |ГДЕ
	               |	торо_ЗаказПоставщикуТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	торо_ЗаказПоставщикуТовары.Номенклатура,
				   |	торо_ЗаказПоставщикуТовары.проф_Назначение,
	               |	торо_ЗаказПоставщикуТовары.Характеристика,
	               |	торо_ЗаказПоставщикуТовары.Склад";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.проф_ЗаказыПоставщику.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.ЗаказПоставщику = Ссылка;
		Движение.ДатаПоставки = ДатаПоставки;
		ЗаполнитьЗначенияСвойств(Движение, Выборка);		
	КонецЦикла;		
	//-- Проф-ИТ, #82, Иванова Е.С., 18.09.2023
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
